use lab3;


DELETE FROM passport;
alter table passport auto_increment = 1;
insert into passport (num_id, series, number, authority, date4, date5, date6, id_country, sex) values
("3210781M064PB6", "МР", "2546711", "Центральное РУВД г.Минска", "1999-8-13", "2015-6-29", "2025-6-29", 1, "М"),
("3210781M064PB7", "МР", "2546712", "Центральное РУВД г.Минска", "1998-6-29", "2015-6-29", "2025-6-29", 2, "М"),
("32М0781M064PB9", "МС", "2546713", "Ленинский РОВД г. Могилева", "1997-3-6", "2015-6-29", "2025-6-29", 3, "М"),
("3210781M064PB8", "МС", "2546714", "Ленинский РОВД г. Могилева", "2000-1-1", "2015-6-29", "2025-6-29", 4, "М"),
("3210781M064PB1", "АВ", "2546715", "Первомайское РУВД г.Минска", "2002-9-3", "2015-6-29", "2025-6-29", 5, "М"),
("3210781M064PB2", "АВ", "2546716", "Первомайское РУВД г.Минска", "1999-12-24", "2015-6-29", "2025-6-29", 6, "Ж"),
("3210781M064PB0", "ВМ", "2546717", "Ленинский РОВД г. Могилева", "2001-5-31", "2015-6-29", "2025-6-29", 7, "Ж"),
("3210781M064PB4", "ВМ", "2546718", "Ленинский РОВД г. Могилева", "2002-4-16", "2015-6-29", "2025-6-29", 8, "Ж"),
("3210781M064PB3", "КВ", "2546719", "Советское РУВД г. Минска", "2001-10-9", "2015-6-29", "2025-6-29", 9, "Ж"),
("3210781M064PB5", "КВ", "2546710", "Советское РУВД г. Минска", "1998-2-11", "2015-6-29", "2025-6-29", 10, "Ж");


DELETE FROM address;
alter table address auto_increment = 1;
insert into address (id_country, id_region, id_city, id_street, street_type, id_district, building, house_num, room_num, city_type, zip_code, email, skype, country_code, operator_code, personal_num) values
(1, 1, 1, 1, "улица", 1, 'А', "123", "110", "город", 223610, "vanya@mail.ru", "vanya", 375, 29, 5364129),
(1, 1, 1, 2, "улица", 2, 'А', "43", "22", "город", 223610, "olya@mail.ru", "olya", 375, 29, 4364129),
(1, 1, 2, 3, "улица", 3, null, "93", "10", "город", 223610, "julia@mail.ru", "julia", 375, 33, 3364129),
(2, 2, 2, 4, "улица", 4, null, "88", "90", "город", 223610, "roma@mail.ru", "roma", 375, 33, 2364129),
(3, 3, 3, 5, "улица", 2, null, "3", "67", "город", 223610, "victor@mail.ru", "victor", 375, 44, 1364129),
(5, 5, 3, 6,  "улица", 1, null, "7", "45", "город", 223610, "ann@mail.ru", "ann", 375, 44, 5364128),
(7, 7, 5, 7, "улица", 1, 'Б', "110", "98", "город", 223610, "zheka@mail.ru", "zheka44", 375, 44, 5364127),
(8, 8, 7, 8, "улица", 1, 'Б', "13", "13", "город", 223610, "kirill666@mail.ru", "kirik123", 375, 33, 5364126),
(9, 9, 8, 9, "улица", 9, 'В', "14", "143", "город", 223610, "vitek13424@mail.ru", "vitek3", 375, 29, 5364125),
(10, 6, 9, 10, "улица", 1, 'В', "53", "71", "город", 223610, "huli666666@mail.ru", "fuckme999", 375, 29, 5364124);


DELETE FROM student;
alter table student auto_increment = 1;
insert into student (id_name1, id_name2, id_name3, id_passport, id_address, id_university, id_faculty, id_spec, student.group, card_num, course, isbudget, date1, date2, date3) values
(1, 2, 2, 1, 1, 1, 1, 1, 753501, 75350011, 3, true, "2017-6-30", "2021-6-30", now()),
(2, 3, 3, 2, 2, 2, 2, 2, 751002, 75100022, 3, true, "2017-6-30", "2021-6-30", now()),
(3, 4, 4, 3, 3, 3, 3, 3, 753503, 75350033, 3, true, "2017-6-30", "2021-6-30", now()),
(4, 5, 5, 4, 4, 4, 4, 4, 953501, 95350011, 1, true, "2019-6-30", "2023-6-30", now()),
(5, 6, 6, 5, 5, 5, 5, 5, 953502, 95350022, 1, true, "2019-6-30", "2023-6-30", now()),
(6, 7, 7, 6, 6, 6, 6, 6, 953501, 95350033, 1, false, "2019-6-30", "2023-6-30", now()),
(7, 8, 8, 7, 7, 7, 7, 7, 853504, 85350011, 2, false, "2018-6-30", "2022-6-30", now()),
(8, 9, 9, 8, 8, 8, 8, 8, 853505, 85350022, 2, false, "2018-6-30", "2022-6-30", now()),
(9, 10, 10, 9, 9, 9, 9, 9, 853501, 85350033, 2, false, "2018-6-30", "2022-6-30", now()),
(10, 11, 11, 10, 10, 10, 10, 10, 653501, 65350011, 4, false, "2016-6-30", "2020-6-30", now());

select * from student;