use lab6;

delete from name1;
insert into name1 values (1, 'Свелана'),(2, 'Мария'),(3, 'Алексей'),(4, 'Никита'),(5, 'Владислав'),(6, 'Григорий'),(7, 'Елизавета'),(8, 'Анастасия'),(9, 'Кирилл'),(10, 'Артём');

-- delete from name2;
-- alter table name2 auto_increment = 1;
-- insert into name2 (name) values ('Березкин'),('Иващук'),('Полимчик'),('Сахарова'),('Курило'),('Прокопеня'),('Будняк'),('Миховин'),('Палазник'),('Артемьева');

-- delete from name3;
-- alter table name3 auto_increment = 1;
-- insert into name3 (name) values ('Андреевич'),('Алексеевич'),('Александрович'),('Владиславович'),('Светлановна'),('Григорьевич'),('Елизаветовна'),('Михайловна'),('Павлович'),('Артёмович');
